
!(function () {
  const userInput = document.querySelector("#userText");
  const resultOutput = document.querySelector("#newText");
  userInput.addEventListener("input", latinToUnicode)

  const c1 = {
    0: "0",
    1: "1",
    2: "2",
    3: "3",
    4: "4",
    5: "5",
    6: "6",
    7: "7",
    8: "8",
    9: "9",
    a: "ᗩ",
    b: "ᗷ",
    c: "ᑕ",
    d: "ᗪ",
    e: "E",
    f: "ᖴ",
    g: "G",
    h: "ᕼ",
    i: "I",
    j: "ᒍ",
    k: "K",
    l: "ᒪ",
    m: "ᗰ",
    n: "ᑎ",
    o: "O",
    p: "ᑭ",
    q: "ᑫ",
    r: "ᖇ",
    s: "ᔕ",
    t: "T",
    u: "ᑌ",
    v: "ᐯ",
    w: "ᗯ",
    x: "᙭",
    y: "Y",
    z: "ᘔ",
    A: "ᗩ",
    B: "ᗷ",
    C: "ᑕ",
    D: "ᗪ",
    E: "E",
    F: "ᖴ",
    G: "G",
    H: "ᕼ",
    I: "I",
    J: "ᒍ",
    K: "K",
    L: "ᒪ",
    M: "ᗰ",
    N: "ᑎ",
    O: "O",
    P: "ᑭ",
    Q: "ᑫ",
    R: "ᖇ",
    S: "ᔕ",
    T: "T",
    U: "ᑌ",
    V: "ᐯ",
    W: "ᗯ",
    X: "᙭",
    Y: "Y",
    Z: "ᘔ",
  },

    c2 = {
      "`": "`",
      1: "１",
      2: "２",
      3: "３",
      4: "４",
      5: "５",
      6: "６",
      7: "７",
      8: "８",
      9: "９",
      0: "０",
      "-": "－",
      "=": "＝",
      "~": "~",
      "!": "！",
      "@": "＠",
      "#": "＃",
      $: "＄",
      "%": "％",
      "^": "^",
      "&": "＆",
      "*": "＊",
      "(": "（",
      ")": "）",
      _: "_",
      "+": "＋",
      q: "ｑ",
      w: "ｗ",
      e: "ｅ",
      r: "ｒ",
      t: "ｔ",
      y: "ｙ",
      u: "ｕ",
      i: "ｉ",
      o: "ｏ",
      p: "ｐ",
      "[": "[",
      "]": "]",
      "\\": "\\",
      Q: "Ｑ",
      W: "Ｗ",
      E: "Ｅ",
      R: "Ｒ",
      T: "Ｔ",
      Y: "Ｙ",
      U: "Ｕ",
      I: "Ｉ",
      O: "Ｏ",
      P: "Ｐ",
      "{": "{",
      "}": "}",
      "|": "|",
      a: "ａ",
      s: "ｓ",
      d: "ｄ",
      f: "ｆ",
      g: "ｇ",
      h: "ｈ",
      j: "ｊ",
      k: "ｋ",
      l: "ｌ",
      ";": "；",
      "'": "＇",
      A: "Ａ",
      S: "Ｓ",
      D: "Ｄ",
      F: "Ｆ",
      G: "Ｇ",
      H: "Ｈ",
      J: "Ｊ",
      K: "Ｋ",
      L: "Ｌ",
      ":": "：",
      '"': '"',
      z: "ｚ",
      x: "ｘ",
      c: "ｃ",
      v: "ｖ",
      b: "ｂ",
      n: "ｎ",
      m: "ｍ",
      ",": "，",
      ".": "．",
      "/": "／",
      Z: "Ｚ",
      X: "Ｘ",
      C: "Ｃ",
      V: "Ｖ",
      B: "Ｂ",
      N: "Ｎ",
      M: "Ｍ",
      "<": "<",
      ">": ">",
      "?": "？",
    },
    c3 = {
      0: "𝟘",
      1: "𝟙",
      2: "𝟚",
      3: "𝟛",
      4: "𝟜",
      5: "𝟝",
      6: "𝟞",
      7: "𝟟",
      8: "𝟠",
      9: "𝟡",
      a: "𝕒",
      b: "𝕓",
      c: "𝕔",
      d: "𝕕",
      e: "𝕖",
      f: "𝕗",
      g: "𝕘",
      h: "𝕙",
      i: "𝕚",
      j: "𝕛",
      k: "𝕜",
      l: "𝕝",
      m: "𝕞",
      n: "𝕟",
      o: "𝕠",
      p: "𝕡",
      q: "𝕢",
      r: "𝕣",
      s: "𝕤",
      t: "𝕥",
      u: "𝕦",
      v: "𝕧",
      w: "𝕨",
      x: "𝕩",
      y: "𝕪",
      z: "𝕫",
      A: "𝔸",
      B: "𝔹",
      C: "ℂ",
      D: "𝔻",
      E: "𝔼",
      F: "𝔽",
      G: "𝔾",
      H: "ℍ",
      I: "𝕀",
      J: "𝕁",
      K: "𝕂",
      L: "𝕃",
      M: "𝕄",
      N: "ℕ",
      O: "𝕆",
      P: "ℙ",
      Q: "ℚ",
      R: "ℝ",
      S: "𝕊",
      T: "𝕋",
      U: "𝕌",
      V: "𝕍",
      W: "𝕎",
      X: "𝕏",
      Y: "𝕐",
      Z: "ℤ",
    },
    c4 = {
      0: "⊘",
      1: "𝟙",
      2: "ϩ",
      3: "Ӡ",
      4: "५",
      5: "Ƽ",
      6: "Ϭ",
      7: "7",
      8: "𝟠",
      9: "९",
      a: "ą",
      b: "ҍ",
      c: "ç",
      d: "ժ",
      e: "ҽ",
      f: "ƒ",
      g: "ց",
      h: "հ",
      i: "ì",
      j: "ʝ",
      k: "ҟ",
      l: "Ӏ",
      m: "ʍ",
      n: "ղ",
      o: "օ",
      p: "ք",
      q: "զ",
      r: "ɾ",
      s: "ʂ",
      t: "է",
      u: "մ",
      v: "ѵ",
      w: "ա",
      x: "×",
      y: "վ",
      z: "Հ",
      A: "Ⱥ",
      B: "β",
      C: "↻",
      D: "Ꭰ",
      E: "Ɛ",
      F: "Ƒ",
      G: "Ɠ",
      H: "Ƕ",
      I: "į",
      J: "ل",
      K: "Ҡ",
      L: "Ꝉ",
      M: "Ɱ",
      N: "ហ",
      O: "ට",
      P: "φ",
      Q: "Ҩ",
      R: "འ",
      S: "Ϛ",
      T: "Ͳ",
      U: "Ա",
      V: "Ỽ",
      W: "చ",
      X: "ჯ",
      Y: "Ӌ",
      Z: "ɀ",
    },
    c5 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "𝒂",
      b: "𝒃",
      c: "𝒄",
      d: "𝒅",
      e: "𝒆",
      f: "𝒇",
      g: "𝒈",
      h: "𝒉",
      i: "𝒊",
      j: "𝒋",
      k: "𝒌",
      l: "𝒍",
      m: "𝒎",
      n: "𝒏",
      o: "𝒐",
      p: "𝒑",
      q: "𝒒",
      r: "𝒓",
      s: "𝒔",
      t: "𝒕",
      u: "𝒖",
      v: "𝒗",
      w: "𝒘",
      x: "𝒙",
      y: "𝒚",
      z: "𝒛",
      A: "𝑨",
      B: "𝑩",
      C: "𝑪",
      D: "𝑫",
      E: "𝑬",
      F: "𝑭",
      G: "𝑮",
      H: "𝑯",
      I: "𝑰",
      J: "𝑱",
      K: "𝑲",
      L: "𝑳",
      M: "𝑴",
      N: "𝑵",
      O: "𝑶",
      P: "𝑷",
      Q: "𝑸",
      R: "𝑹",
      S: "𝑺",
      T: "𝑻",
      U: "𝑼",
      V: "𝑽",
      W: "𝑾",
      X: "𝑿",
      Y: "𝒀",
      Z: "𝒁",
    },
    c6 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "α",
      b: "Ⴆ",
      c: "ƈ",
      d: "ԃ",
      e: "ҽ",
      f: "ϝ",
      g: "ɠ",
      h: "ԋ",
      i: "ι",
      j: "ʝ",
      k: "ƙ",
      l: "ʅ",
      m: "ɱ",
      n: "ɳ",
      o: "σ",
      p: "ρ",
      q: "ϙ",
      r: "ɾ",
      s: "ʂ",
      t: "ƚ",
      u: "υ",
      v: "ʋ",
      w: "ɯ",
      x: "x",
      y: "ყ",
      z: "ȥ",
      A: "A",
      B: "B",
      C: "C",
      D: "D",
      E: "E",
      F: "F",
      G: "G",
      H: "H",
      I: "I",
      J: "J",
      K: "K",
      L: "L",
      M: "M",
      N: "N",
      O: "O",
      P: "P",
      Q: "Q",
      R: "R",
      S: "S",
      T: "T",
      U: "U",
      V: "V",
      W: "W",
      X: "X",
      Y: "Y",
      Z: "Z",
    },
    c7 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ค",
      b: "๒",
      c: "ς",
      d: "๔",
      e: "є",
      f: "Ŧ",
      g: "ﻮ",
      h: "ђ",
      i: "เ",
      j: "ן",
      k: "к",
      l: "ɭ",
      m: "๓",
      n: "ภ",
      o: "๏",
      p: "ק",
      q: "ợ",
      r: "г",
      s: "ร",
      t: "Շ",
      u: "ย",
      v: "ש",
      w: "ฬ",
      x: "א",
      y: "ץ",
      z: "չ",
      A: "ค",
      B: "๒",
      C: "ς",
      D: "๔",
      E: "є",
      F: "Ŧ",
      G: "ﻮ",
      H: "ђ",
      I: "เ",
      J: "ן",
      K: "к",
      L: "ɭ",
      M: "๓",
      N: "ภ",
      O: "๏",
      P: "ק",
      Q: "ợ",
      R: "г",
      S: "ร",
      T: "Շ",
      U: "ย",
      V: "ש",
      W: "ฬ",
      X: "א",
      Y: "ץ",
      Z: "չ",
    },
    c8 = { q: "🆀", w: "🆆", e: "🅴", r: "🆁", t: "🆃", y: "🆈", u: "🆄", i: "🅸", o: "🅾", p: "🅿", a: "🅰", s: "🆂", d: "🅳", f: "🅵", g: "🅶", h: "🅷", j: "🅹", k: "🅺", l: "🅻", z: "🆉", x: "🆇", c: "🅲", v: "🆅", b: "🅱", n: "🅽", m: "🅼" },
    c9 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "𝙖",
      b: "𝙗",
      c: "𝙘",
      d: "𝙙",
      e: "𝙚",
      f: "𝙛",
      g: "𝙜",
      h: "𝙝",
      i: "𝙞",
      j: "𝙟",
      k: "𝙠",
      l: "𝙡",
      m: "𝙢",
      n: "𝙣",
      o: "𝙤",
      p: "𝙥",
      q: "𝙦",
      r: "𝙧",
      s: "𝙨",
      t: "𝙩",
      u: "𝙪",
      v: "𝙫",
      w: "𝙬",
      x: "𝙭",
      y: "𝙮",
      z: "𝙯",
      A: "𝘼",
      B: "𝘽",
      C: "𝘾",
      D: "𝘿",
      E: "𝙀",
      F: "𝙁",
      G: "𝙂",
      H: "𝙃",
      I: "𝙄",
      J: "𝙅",
      K: "𝙆",
      L: "𝙇",
      M: "𝙈",
      N: "𝙉",
      O: "𝙊",
      P: "𝙋",
      Q: "𝙌",
      R: "𝙍",
      S: "𝙎",
      T: "𝙏",
      U: "𝙐",
      V: "𝙑",
      W: "𝙒",
      X: "𝙓",
      Y: "𝙔",
      Z: "𝙕",
    },
    c01 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ﾑ",
      b: "乃",
      c: "ᄃ",
      d: "り",
      e: "乇",
      f: "ｷ",
      g: "ム",
      h: "ん",
      i: "ﾉ",
      j: "ﾌ",
      k: "ズ",
      l: "ﾚ",
      m: "ﾶ",
      n: "刀",
      o: "の",
      p: "ｱ",
      q: "ゐ",
      r: "尺",
      s: "丂",
      t: "ｲ",
      u: "ひ",
      v: "√",
      w: "W",
      x: "ﾒ",
      y: "ﾘ",
      z: "乙",
      A: "ﾑ",
      B: "乃",
      C: "ᄃ",
      D: "り",
      E: "乇",
      F: "ｷ",
      G: "ム",
      H: "ん",
      I: "ﾉ",
      J: "ﾌ",
      K: "ズ",
      L: "ﾚ",
      M: "ﾶ",
      N: "刀",
      O: "の",
      P: "ｱ",
      Q: "ゐ",
      R: "尺",
      S: "丂",
      T: "ｲ",
      U: "ひ",
      V: "√",
      W: "W",
      X: "ﾒ",
      Y: "ﾘ",
      Z: "乙",
    },
    c02 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ą",
      b: "ც",
      c: "ƈ",
      d: "ɖ",
      e: "ɛ",
      f: "ʄ",
      g: "ɠ",
      h: "ɧ",
      i: "ı",
      j: "ʝ",
      k: "ƙ",
      l: "Ɩ",
      m: "ɱ",
      n: "ŋ",
      o: "ơ",
      p: "℘",
      q: "զ",
      r: "ཞ",
      s: "ʂ",
      t: "ɬ",
      u: "ų",
      v: "۷",
      w: "ῳ",
      x: "ҳ",
      y: "ყ",
      z: "ʑ",
      A: "ą",
      B: "ც",
      C: "ƈ",
      D: "ɖ",
      E: "ɛ",
      F: "ʄ",
      G: "ɠ",
      H: "ɧ",
      I: "ı",
      J: "ʝ",
      K: "ƙ",
      L: "Ɩ",
      M: "ɱ",
      N: "ŋ",
      O: "ơ",
      P: "℘",
      Q: "զ",
      R: "ཞ",
      S: "ʂ",
      T: "ɬ",
      U: "ų",
      V: "۷",
      W: "ῳ",
      X: "ҳ",
      Y: "ყ",
      Z: "ʑ",
    },
    c03 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ค",
      b: "๖",
      c: "¢",
      d: "໓",
      e: "ē",
      f: "f",
      g: "ງ",
      h: "h",
      i: "i",
      j: "ว",
      k: "k",
      l: "l",
      m: "๓",
      n: "ຖ",
      o: "໐",
      p: "p",
      q: "๑",
      r: "r",
      s: "Ş",
      t: "t",
      u: "น",
      v: "ง",
      w: "ຟ",
      x: "x",
      y: "ฯ",
      z: "ຊ",
      A: "ค",
      B: "๖",
      C: "¢",
      D: "໓",
      E: "ē",
      F: "f",
      G: "ງ",
      H: "h",
      I: "i",
      J: "ว",
      K: "k",
      L: "l",
      M: "๓",
      N: "ຖ",
      O: "໐",
      P: "p",
      Q: "๑",
      R: "r",
      S: "Ş",
      T: "t",
      U: "น",
      V: "ง",
      W: "ຟ",
      X: "x",
      Y: "ฯ",
      Z: "ຊ",
    },
    c04 = {
      a: "ɑׁׅ֮",
      b: "ϐׁׅ֒",
      c: "ᝯׁ",
      d: "ժׁׅ݊",
      e: "ꫀׁׅܻ",
      f: "⨍",
      g: "ᧁׁ",
      h: "hׁׅ֮",
      i: "ꪱׁׅ",
      j: "յׁׅ",
      k: "ƙׁׅ֑",
      l: "ᥣׁׅ֪",
      m: " ꩇׁׅ݊",
      n: "ꪀׁׅ",
      o: "ᨵׁׅ",
      p: "℘",
      q: "qׁׅ",
      r: "ꭈׁׅ",
      s: "꯱ׁׅ֒",
      t: "tׁׅ",
      u: "υׁׅ",
      v: "᥎꫶ׁׅ",
      w: "ᨰׁׅ",
      x: "᥊ׁׅ",
      y: "ᨮ꫶ׁׅ֮",
      z: "zׁׅ֬",
    },
    c05 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ᗩ",
      b: "ᗷ",
      c: "ᑢ",
      d: "ᕲ",
      e: "ᘿ",
      f: "ᖴ",
      g: "ᘜ",
      h: "ᕼ",
      i: "ᓰ",
      j: "ᒚ",
      k: "ᖽᐸ",
      l: "ᒪ",
      m: "ᘻ",
      n: "ᘉ",
      o: "ᓍ",
      p: "ᕵ",
      q: "ᕴ",
      r: "ᖇ",
      s: "S",
      t: "ᖶ",
      u: "ᑘ",
      v: "ᐺ",
      w: "ᘺ",
      x: "᙭",
      y: "ᖻ",
      z: "ᗱ",
      A: "ᗩ",
      B: "ᗷ",
      C: "ᑢ",
      D: "ᕲ",
      E: "ᘿ",
      F: "ᖴ",
      G: "ᘜ",
      H: "ᕼ",
      I: "ᓰ",
      J: "ᒚ",
      K: "ᖽᐸ",
      L: "ᒪ",
      M: "ᘻ",
      N: "ᘉ",
      O: "ᓍ",
      P: "ᕵ",
      Q: "ᕴ",
      R: "ᖇ",
      S: "S",
      T: "ᖶ",
      U: "ᑘ",
      V: "ᐺ",
      W: "ᘺ",
      X: "᙭",
      Y: "ᖻ",
      Z: "ᗱ",
    },
    c06 = {
      " ": "　",
      "`": "`",
      1: "１",
      2: "２",
      3: "３",
      4: "４",
      5: "５",
      6: "６",
      7: "７",
      8: "８",
      9: "９",
      0: "０",
      "-": "－",
      "=": "＝",
      "~": "~",
      "!": "！",
      "@": "＠",
      "#": "＃",
      $: "＄",
      "%": "％",
      "^": "^",
      "&": "＆",
      "*": "＊",
      "(": "（",
      ")": "）",
      _: "_",
      "+": "＋",
      q: "ｑ",
      w: "ｗ",
      e: "ｅ",
      r: "ｒ",
      t: "ｔ",
      y: "ｙ",
      u: "ｕ",
      i: "ｉ",
      o: "ｏ",
      p: "ｐ",
      "[": "[",
      "]": "]",
      "\\": "\\",
      Q: "Ｑ",
      W: "Ｗ",
      E: "Ｅ",
      R: "Ｒ",
      T: "Ｔ",
      Y: "Ｙ",
      U: "Ｕ",
      I: "Ｉ",
      O: "Ｏ",
      P: "Ｐ",
      "{": "{",
      "}": "}",
      "|": "|",
      a: "ａ",
      s: "ｓ",
      d: "ｄ",
      f: "ｆ",
      g: "ｇ",
      h: "ｈ",
      j: "ｊ",
      k: "ｋ",
      l: "ｌ",
      ";": "；",
      "'": "＇",
      A: "Ａ",
      S: "Ｓ",
      D: "Ｄ",
      F: "Ｆ",
      G: "Ｇ",
      H: "Ｈ",
      J: "Ｊ",
      K: "Ｋ",
      L: "Ｌ",
      ":": "：",
      '"': '"',
      z: "ｚ",
      x: "ｘ",
      c: "ｃ",
      v: "ｖ",
      b: "ｂ",
      n: "ｎ",
      m: "ｍ",
      ",": "，",
      ".": "．",
      "/": "／",
      Z: "Ｚ",
      X: "Ｘ",
      C: "Ｃ",
      V: "Ｖ",
      B: "Ｂ",
      N: "Ｎ",
      M: "Ｍ",
      "<": "<",
      ">": ">",
      "?": "？",
    },

    c08 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "𝘢",
      b: "𝘣",
      c: "𝘤",
      d: "𝘥",
      e: "𝘦",
      f: "𝘧",
      g: "𝘨",
      h: "𝘩",
      i: "𝘪",
      j: "𝘫",
      k: "𝘬",
      l: "𝘭",
      m: "𝘮",
      n: "𝘯",
      o: "𝘰",
      p: "𝘱",
      q: "𝘲",
      r: "𝘳",
      s: "𝘴",
      t: "𝘵",
      u: "𝘶",
      v: "𝘷",
      w: "𝘸",
      x: "𝘹",
      y: "𝘺",
      z: "𝘻",
      A: "𝘈",
      B: "𝘉",
      C: "𝘊",
      D: "𝘋",
      E: "𝘌",
      F: "𝘍",
      G: "𝘎",
      H: "𝘏",
      I: "𝘐",
      J: "𝘑",
      K: "𝘒",
      L: "𝘓",
      M: "𝘔",
      N: "𝘕",
      O: "𝘖",
      P: "𝘗",
      Q: "𝘘",
      R: "𝘙",
      S: "𝘚",
      T: "𝘛",
      U: "𝘜",
      V: "𝘝",
      W: "𝘞",
      X: "𝘟",
      Y: "𝘠",
      Z: "𝘡",
    },
    c09 = {
      0: "₀",
      1: "₁",
      2: "₂",
      3: "₃",
      4: "₄",
      5: "₅",
      6: "₆",
      7: "₇",
      8: "₈",
      9: "₉",
      a: "ₐ",
      b: "b",
      c: "c",
      d: "d",
      e: "ₑ",
      f: "f",
      g: "g",
      h: "ₕ",
      i: "ᵢ",
      j: "ⱼ",
      k: "ₖ",
      l: "ₗ",
      m: "ₘ",
      n: "ₙ",
      o: "ₒ",
      p: "ₚ",
      q: "q",
      r: "ᵣ",
      s: "ₛ",
      t: "ₜ",
      u: "ᵤ",
      v: "ᵥ",
      w: "w",
      x: "ₓ",
      y: "y",
      z: "z",
      A: "ₐ",
      B: "B",
      C: "C",
      D: "D",
      E: "ₑ",
      F: "F",
      G: "G",
      H: "ₕ",
      I: "ᵢ",
      J: "ⱼ",
      K: "ₖ",
      L: "ₗ",
      M: "ₘ",
      N: "ₙ",
      O: "ₒ",
      P: "ₚ",
      Q: "Q",
      R: "ᵣ",
      S: "ₛ",
      T: "ₜ",
      U: "ᵤ",
      V: "ᵥ",
      W: "W",
      X: "ₓ",
      Y: "Y",
      Z: "Z",
      "+": "₊",
      "-": "₋",
      "=": "₌",
      "(": "₍",
      ")": "₎",
    },
    c10 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "𝓪",
      b: "𝓫",
      c: "𝓬",
      d: "𝓭",
      e: "𝓮",
      f: "𝓯",
      g: "𝓰",
      h: "𝓱",
      i: "𝓲",
      j: "𝓳",
      k: "𝓴",
      l: "𝓵",
      m: "𝓶",
      n: "𝓷",
      o: "𝓸",
      p: "𝓹",
      q: "𝓺",
      r: "𝓻",
      s: "𝓼",
      t: "𝓽",
      u: "𝓾",
      v: "𝓿",
      w: "𝔀",
      x: "𝔁",
      y: "𝔂",
      z: "𝔃",
      A: "𝓐",
      B: "𝓑",
      C: "𝓒",
      D: "𝓓",
      E: "𝓔",
      F: "𝓕",
      G: "𝓖",
      H: "𝓗",
      I: "𝓘",
      J: "𝓙",
      K: "𝓚",
      L: "𝓛",
      M: "𝓜",
      N: "𝓝",
      O: "𝓞",
      P: "𝓟",
      Q: "𝓠",
      R: "𝓡",
      S: "𝓢",
      T: "𝓣",
      U: "𝓤",
      V: "𝓥",
      W: "𝓦",
      X: "𝓧",
      Y: "𝓨",
      Z: "𝓩",
    },
    c11 = {
      0: "𝟶",
      1: "𝟷",
      2: "𝟸",
      3: "𝟹",
      4: "𝟺",
      5: "𝟻",
      6: "𝟼",
      7: "𝟽",
      8: "𝟾",
      9: "𝟿",
      a: "𝚊",
      b: "𝚋",
      c: "𝚌",
      d: "𝚍",
      e: "𝚎",
      f: "𝚏",
      g: "𝚐",
      h: "𝚑",
      i: "𝚒",
      j: "𝚓",
      k: "𝚔",
      l: "𝚕",
      m: "𝚖",
      n: "𝚗",
      o: "𝚘",
      p: "𝚙",
      q: "𝚚",
      r: "𝚛",
      s: "𝚜",
      t: "𝚝",
      u: "𝚞",
      v: "𝚟",
      w: "𝚠",
      x: "𝚡",
      y: "𝚢",
      z: "𝚣",
      A: "𝙰",
      B: "𝙱",
      C: "𝙲",
      D: "𝙳",
      E: "𝙴",
      F: "𝙵",
      G: "𝙶",
      H: "𝙷",
      I: "𝙸",
      J: "𝙹",
      K: "𝙺",
      L: "𝙻",
      M: "𝙼",
      N: "𝙽",
      O: "𝙾",
      P: "𝙿",
      Q: "𝚀",
      R: "𝚁",
      S: "𝚂",
      T: "𝚃",
      U: "𝚄",
      V: "𝚅",
      W: "𝚆",
      X: "𝚇",
      Y: "𝚈",
      Z: "𝚉",
    },
    c12 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "Λ",
      b: "B",
      c: "ᄃ",
      d: "D",
      e: "Σ",
      f: "F",
      g: "G",
      h: "Ή",
      i: "I",
      j: "J",
      k: "K",
      l: "ᄂ",
      m: "M",
      n: "П",
      o: "Ө",
      p: "P",
      q: "Q",
      r: "Я",
      s: "Ƨ",
      t: "Ƭ",
      u: "Ц",
      v: "V",
      w: "Щ",
      x: "X",
      y: "Y",
      z: "Z",
      A: "Λ",
      B: "B",
      C: "ᄃ",
      D: "D",
      E: "Σ",
      F: "F",
      G: "G",
      H: "Ή",
      I: "I",
      J: "J",
      K: "K",
      L: "ᄂ",
      M: "M",
      N: "П",
      O: "Ө",
      P: "P",
      Q: "Q",
      R: "Я",
      S: "Ƨ",
      T: "Ƭ",
      U: "Ц",
      V: "V",
      W: "Щ",
      X: "X",
      Y: "Y",
      Z: "Z",
    },
    c13 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "ǟ",
      b: "ɮ",
      c: "ƈ",
      d: "ɖ",
      e: "ɛ",
      f: "ʄ",
      g: "ɢ",
      h: "ɦ",
      i: "ɨ",
      j: "ʝ",
      k: "ӄ",
      l: "ʟ",
      m: "ʍ",
      n: "ռ",
      o: "օ",
      p: "ք",
      q: "զ",
      r: "ʀ",
      s: "ֆ",
      t: "ȶ",
      u: "ʊ",
      v: "ʋ",
      w: "ա",
      x: "Ӽ",
      y: "ʏ",
      z: "ʐ",
      A: "ǟ",
      B: "ɮ",
      C: "ƈ",
      D: "ɖ",
      E: "ɛ",
      F: "ʄ",
      G: "ɢ",
      H: "ɦ",
      I: "ɨ",
      J: "ʝ",
      K: "ӄ",
      L: "ʟ",
      M: "ʍ",
      N: "ռ",
      O: "օ",
      P: "ք",
      Q: "զ",
      R: "ʀ",
      S: "ֆ",
      T: "ȶ",
      U: "ʊ",
      V: "ʋ",
      W: "ա",
      X: "Ӽ",
      Y: "ʏ",
      Z: "ʐ",
    },
    c14 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "α",
      b: "в",
      c: "¢",
      d: "∂",
      e: "є",
      f: "ƒ",
      g: "g",
      h: "н",
      i: "ι",
      j: "נ",
      k: "к",
      l: "ℓ",
      m: "м",
      n: "η",
      o: "σ",
      p: "ρ",
      q: "q",
      r: "я",
      s: "ѕ",
      t: "т",
      u: "υ",
      v: "ν",
      w: "ω",
      x: "χ",
      y: "у",
      z: "z",
      A: "α",
      B: "в",
      C: "¢",
      D: "∂",
      E: "є",
      F: "ƒ",
      G: "g",
      H: "н",
      I: "ι",
      J: "נ",
      K: "к",
      L: "ℓ",
      M: "м",
      N: "η",
      O: "σ",
      P: "ρ",
      Q: "q",
      R: "я",
      S: "ѕ",
      T: "т",
      U: "υ",
      V: "ν",
      W: "ω",
      X: "χ",
      Y: "у",
      Z: "z",
    },
    c15 = {
      a: "𝔞",
      b: "𝔟",
      c: "𝔠",
      d: "𝔡",
      e: "𝔢",
      f: "𝔣",
      g: "𝔤",
      h: "𝔥",
      i: "𝔦",
      j: "𝔧",
      k: "𝔨",
      l: "𝔩",
      m: "𝔪",
      n: "𝔫",
      o: "𝔬",
      p: "𝔭",
      q: "𝔮",
      r: "𝔯",
      s: "𝔰",
      t: "𝔱",
      u: "𝔲",
      v: "𝔳",
      w: "𝔴",
      x: "𝔵",
      y: "𝔶",
      z: "𝔷",
      A: "𝔄",
      B: "𝔅",
      C: "ℭ",
      D: "𝔇",
      E: "𝔈",
      F: "𝔉",
      G: "𝔊",
      H: "ℌ",
      I: "ℑ",
      J: "𝔍",
      K: "𝔎",
      L: "𝔏",
      M: "𝔐",
      N: "𝔑",
      O: "𝔒",
      P: "𝔓",
      Q: "𝔔",
      R: "ℜ",
      S: "𝔖",
      T: "𝔗",
      U: "𝔘",
      V: "𝔙",
      W: "𝔚",
      X: "𝔛",
      Y: "𝔜",
      Z: "ℨ",
    },
    c16 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "𝖆",
      b: "𝖇",
      c: "𝖈",
      d: "𝖉",
      e: "𝖊",
      f: "𝖋",
      g: "𝖌",
      h: "𝖍",
      i: "𝖎",
      j: "𝖏",
      k: "𝖐",
      l: "𝖑",
      m: "𝖒",
      n: "𝖓",
      o: "𝖔",
      p: "𝖕",
      q: "𝖖",
      r: "𝖗",
      s: "𝖘",
      t: "𝖙",
      u: "𝖚",
      v: "𝖛",
      w: "𝖜",
      x: "𝖝",
      y: "𝖞",
      z: "𝖟",
      A: "𝕬",
      B: "𝕭",
      C: "𝕮",
      D: "𝕯",
      E: "𝕰",
      F: "𝕱",
      G: "𝕲",
      H: "𝕳",
      I: "𝕴",
      J: "𝕵",
      K: "𝕶",
      L: "𝕷",
      M: "𝕸",
      N: "𝕹",
      O: "𝕺",
      P: "𝕻",
      Q: "𝕼",
      R: "𝕽",
      S: "𝕾",
      T: "𝕿",
      U: "𝖀",
      V: "𝖁",
      W: "𝖂",
      X: "𝖃",
      Y: "𝖄",
      Z: "𝖅",
    },
    c17 = {
      0: "⁰",
      1: "¹",
      2: "²",
      3: "³",
      4: "⁴",
      5: "⁵",
      6: "⁶",
      7: "⁷",
      8: "⁸",
      9: "⁹",
      a: "ᵃ",
      b: "ᵇ",
      c: "ᶜ",
      d: "ᵈ",
      e: "ᵉ",
      f: "ᶠ",
      g: "ᵍ",
      h: "ʰ",
      i: "ⁱ",
      j: "ʲ",
      k: "ᵏ",
      l: "ˡ",
      m: "ᵐ",
      n: "ⁿ",
      o: "ᵒ",
      p: "ᵖ",
      q: "q",
      r: "ʳ",
      s: "ˢ",
      t: "ᵗ",
      u: "ᵘ",
      v: "ᵛ",
      w: "ʷ",
      x: "ˣ",
      y: "ʸ",
      z: "ᶻ",
      A: "ᴬ",
      B: "ᴮ",
      C: "ᶜ",
      D: "ᴰ",
      E: "ᴱ",
      F: "ᶠ",
      G: "ᴳ",
      H: "ᴴ",
      I: "ᴵ",
      J: "ᴶ",
      K: "ᴷ",
      L: "ᴸ",
      M: "ᴹ",
      N: "ᴺ",
      O: "ᴼ",
      P: "ᴾ",
      Q: "Q",
      R: "ᴿ",
      S: "ˢ",
      T: "ᵀ",
      U: "ᵁ",
      V: "ⱽ",
      W: "ᵂ",
      X: "ˣ",
      Y: "ʸ",
      Z: "ᶻ",
      "+": "⁺",
      "-": "⁻",
      "=": "⁼",
      "(": "⁽",
      ")": "⁾",
    },
    c18 = {
      0: "𝟎",
      1: "𝟏",
      2: "𝟐",
      3: "𝟑",
      4: "𝟒",
      5: "𝟓",
      6: "𝟔",
      7: "𝟕",
      8: "𝟖",
      9: "𝟗",
      a: "𝐚",
      b: "𝐛",
      c: "𝐜",
      d: "𝐝",
      e: "𝐞",
      f: "𝐟",
      g: "𝐠",
      h: "𝐡",
      i: "𝐢",
      j: "𝐣",
      k: "𝐤",
      l: "𝐥",
      m: "𝐦",
      n: "𝐧",
      o: "𝐨",
      p: "𝐩",
      q: "𝐪",
      r: "𝐫",
      s: "𝐬",
      t: "𝐭",
      u: "𝐮",
      v: "𝐯",
      w: "𝐰",
      x: "𝐱",
      y: "𝐲",
      z: "𝐳",
      A: "𝐀",
      B: "𝐁",
      C: "𝐂",
      D: "𝐃",
      E: "𝐄",
      F: "𝐅",
      G: "𝐆",
      H: "𝐇",
      I: "𝐈",
      J: "𝐉",
      K: "𝐊",
      L: "𝐋",
      M: "𝐌",
      N: "𝐍",
      O: "𝐎",
      P: "𝐏",
      Q: "𝐐",
      R: "𝐑",
      S: "𝐒",
      T: "𝐓",
      U: "𝐔",
      V: "𝐕",
      W: "𝐖",
      X: "𝐗",
      Y: "𝐘",
      Z: "𝐙",
    },
    c19 = {
      0: "𝟬",
      1: "𝟭",
      2: "𝟮",
      3: "𝟯",
      4: "𝟰",
      5: "𝟱",
      6: "𝟲",
      7: "𝟳",
      8: "𝟴",
      9: "𝟵",
      a: "𝗮",
      b: "𝗯",
      c: "𝗰",
      d: "𝗱",
      e: "𝗲",
      f: "𝗳",
      g: "𝗴",
      h: "𝗵",
      i: "𝗶",
      j: "𝗷",
      k: "𝗸",
      l: "𝗹",
      m: "𝗺",
      n: "𝗻",
      o: "𝗼",
      p: "𝗽",
      q: "𝗾",
      r: "𝗿",
      s: "𝘀",
      t: "𝘁",
      u: "𝘂",
      v: "𝘃",
      w: "𝘄",
      x: "𝘅",
      y: "𝘆",
      z: "𝘇",
      A: "𝗔",
      B: "𝗕",
      C: "𝗖",
      D: "𝗗",
      E: "𝗘",
      F: "𝗙",
      G: "𝗚",
      H: "𝗛",
      I: "𝗜",
      J: "𝗝",
      K: "𝗞",
      L: "𝗟",
      M: "𝗠",
      N: "𝗡",
      O: "𝗢",
      P: "𝗣",
      Q: "𝗤",
      R: "𝗥",
      S: "𝗦",
      T: "𝗧",
      U: "𝗨",
      V: "𝗩",
      W: "𝗪",
      X: "𝗫",
      Y: "𝗬",
      Z: "𝗭",
    },

    c20 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "₳",
      b: "฿",
      c: "₵",
      d: "Đ",
      e: "Ɇ",
      f: "₣",
      g: "₲",
      h: "Ⱨ",
      i: "ł",
      j: "J",
      k: "₭",
      l: "Ⱡ",
      m: "₥",
      n: "₦",
      o: "Ø",
      p: "₱",
      q: "Q",
      r: "Ɽ",
      s: "₴",
      t: "₮",
      u: "Ʉ",
      v: "V",
      w: "₩",
      x: "Ӿ",
      y: "Ɏ",
      z: "Ⱬ",
      A: "₳",
      B: "฿",
      C: "₵",
      D: "Đ",
      E: "Ɇ",
      F: "₣",
      G: "₲",
      H: "Ⱨ",
      I: "ł",
      J: "J",
      K: "₭",
      L: "Ⱡ",
      M: "₥",
      N: "₦",
      O: "Ø",
      P: "₱",
      Q: "Q",
      R: "Ɽ",
      S: "₴",
      T: "₮",
      U: "Ʉ",
      V: "V",
      W: "₩",
      X: "Ӿ",
      Y: "Ɏ",
      Z: "Ⱬ",
    },
    c21 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "å",
      b: "ß",
      c: "¢",
      d: "Ð",
      e: "ê",
      f: "£",
      g: "g",
      h: "h",
      i: "ï",
      j: "j",
      k: "k",
      l: "l",
      m: "m",
      n: "ñ",
      o: "ð",
      p: "þ",
      q: "q",
      r: "r",
      s: "§",
      t: "†",
      u: "µ",
      v: "v",
      w: "w",
      x: "x",
      y: "¥",
      z: "z",
      A: "Ä",
      B: "ß",
      C: "Ç",
      D: "Ð",
      E: "È",
      F: "£",
      G: "G",
      H: "H",
      I: "Ì",
      J: "J",
      K: "K",
      L: "L",
      M: "M",
      N: "ñ",
      O: "Ö",
      P: "þ",
      Q: "Q",
      R: "R",
      S: "§",
      T: "†",
      U: "Ú",
      V: "V",
      W: "W",
      X: "×",
      Y: "¥",
      Z: "Z",
    },
    c22 = {
      0: "0",
      1: "1",
      2: "2",
      3: "3",
      4: "4",
      5: "5",
      6: "6",
      7: "7",
      8: "8",
      9: "9",
      a: "🄰",
      b: "🄱",
      c: "🄲",
      d: "🄳",
      e: "🄴",
      f: "🄵",
      g: "🄶",
      h: "🄷",
      i: "🄸",
      j: "🄹",
      k: "🄺",
      l: "🄻",
      m: "🄼",
      n: "🄽",
      o: "🄾",
      p: "🄿",
      q: "🅀",
      r: "🅁",
      s: "🅂",
      t: "🅃",
      u: "🅄",
      v: "🅅",
      w: "🅆",
      x: "🅇",
      y: "🅈",
      z: "🅉",
      A: "🄰",
      B: "🄱",
      C: "🄲",
      D: "🄳",
      E: "🄴",
      F: "🄵",
      G: "🄶",
      H: "🄷",
      I: "🄸",
      J: "🄹",
      K: "🄺",
      L: "🄻",
      M: "🄼",
      N: "🄽",
      O: "🄾",
      P: "🄿",
      Q: "🅀",
      R: "🅁",
      S: "🅂",
      T: "🅃",
      U: "🅄",
      V: "🅅",
      W: "🅆",
      X: "🅇",
      Y: "🅈",
      Z: "🅉",
    };


  function latinToUnicode(demo_) {
    const userTxt = userInput.value.trim() || demo_;
    if (userTxt !== "") {
      resultOutput.innerHTML = ""
      let result = ""

      for (let i = 0, uniC = [c1, c2, c3, c4, c5, c6, c7, c8, c9, c01, c02, c03, c04, c05, c06, c08, c09, c10, c11, c12, c13, c14, c15, c16, c17, c18, c19, c20, c21, c22], l = uniC.length; i < l; i++) {
        result += txtInEl(charConvertor(userTxt, uniC[i]), i)
      }

      const charTools = new Lunicode();
      charTools.tools.creepify.options.maxHeight = 5;

      result += txtInEl(charTools.tools.flip.encode(userTxt), 32)
      result += txtInEl(charTools.tools.roundsquares.encode(userTxt) + " roundsquares", 33)
      result += txtInEl(charTools.tools.tiny.encode(userTxt), 34)
      result += txtInEl(charTools.tools.squares.encode(userTxt), 35)
      result += txtInEl(charTools.tools.mirror.encode(userTxt), 36)
      result += txtInEl(charTools.tools.creepify.encode(userTxt), 37)
      result += txtInEl(charTools.tools.bubbles.encode(userTxt), 38)
      result += txtInEl(charTools.tools.bent.encode(userTxt), 39)

      for (let x = 0, newChars = "♪⁂※⁜⁑⁎⁕⁛⁞⁖⁙✓⁘⁝↯◊⇯◈◌◜❤️✨⚡✅◟◝◞◢⊛⋇⋰⋱⌖⨳⩷ϟ∝∞∛∫∻≊≋≣≛≤⊕⊗⊹⋈⋰⋱⨳⪐⫷⫸ΞξϠᾃᾭὦ", y = newChars.length; x < y; x++) {
        result += txtInEl(charJoin(userTxt, newChars, x), x + 40)
      }

      resultOutput.innerHTML = result
    }
  }

  function charConvertor(input, uniChar) {

    let res = ""

    for (let char of input) {
      res += uniChar[char] || char
    }

    return res
  }

  function charJoin(input, chars, x) {
    let nt = ""
    for (let i = 0, q = input.split(" "), l = q.length; i < l; i++) {
      nt += chars[Math.round(Math.random() * (chars.length - 1))] + " " + q[i] + " "
    }

    nt += chars[x]
    return nt
    // return (input.split("").join(" " + chars[x] + " ") + chars[x])
  }

  function txtInEl(txt, id) {
    return "<div class='res-item'><div id='" + id + "'>" + (txt) + "</div><div class='copy-btn bio-btn' onclick='copyRes(" + id + ")'>Copy</div></div>"
  }

  // Lunicode.js
  // on GitHub: https://github.com/combatwombat/Lunicode.js
  // Copyright © 2019 Robert Gerlach 
  function Lunicode() {
    this.tools = {

      // Flip/rotate Text by 180°

      flip: {
        init: function () {

          // invert the map
          for (i in this.map) {
            this.map[this.map[i]] = i;
          }

        },

        encode: function (text) {
          var ret = [],
            ch;

          for (var i = 0, len = text.length; i < len; i++) {
            ch = text.charAt(i);

            // combining diacritical marks: combine with previous character for ä,ö,ü,...
            if (i > 0 && (ch == '\u0324' ||
              ch == '\u0317' ||
              ch == '\u0316' ||
              ch == '\u032e')) {
              ch = this.map[text.charAt(i - 1) + ch];
              ret.pop();

            } else {
              ch = this.map[ch];
              if (typeof (ch) == "undefined") {
                ch = text.charAt(i);
              }
            }

            ret.push(ch);
          }

          return ret.reverse().join("");
        },

        map: {
          'a': '\u0250',
          'b': 'q',
          'c': '\u0254',
          'd': 'p',
          'e': '\u01DD',
          'f': '\u025F',
          'g': '\u0253',
          'h': '\u0265',
          'i': '\u0131',
          'j': '\u027E',
          'k': '\u029E',
          'l': '\u006C',
          'm': '\u026F',
          'n': 'u',
          'r': '\u0279',
          't': '\u0287',
          'v': '\u028C',
          'w': '\u028D',
          'y': '\u028E',
          'A': '\u2200',
          'B': 'ᙠ',
          'C': '\u0186',
          'D': 'ᗡ',
          'E': '\u018e',
          'F': '\u2132',
          'G': '\u2141',
          'J': '\u017f',
          'K': '\u22CA',
          'L': '\u02e5',
          'M': 'W',
          'P': '\u0500',
          'Q': '\u038C',
          'R': '\u1D1A',
          'T': '\u22a5',
          'U': '\u2229',
          'V': '\u039B',
          'Y': '\u2144',
          '1': '\u21c2',
          '2': '\u1105',
          '3': '\u0190',
          '4': '\u3123',
          '5': '\u078e',
          '6': '9',
          '7': '\u3125',
          '&': '\u214b',
          '.': '\u02D9',
          '"': '\u201e',
          ';': '\u061b',
          '[': ']',
          '(': ')',
          '{': '}',
          '?': '\u00BF',
          '!': '\u00A1',
          "\'": ',',
          '<': '>',
          '\u203E': '_',
          '\u00AF': '_',
          '\u203F': '\u2040',
          '\u2045': '\u2046',
          '\u2234': '\u2235',
          '\r': '\n',
          'ß': 'ᙠ',

          '\u0308': '\u0324',
          'ä': 'ɐ' + '\u0324',
          'ö': 'o' + '\u0324',
          'ü': 'n' + '\u0324',
          'Ä': '\u2200' + '\u0324',
          'Ö': 'O' + '\u0324',
          'Ü': '\u2229' + '\u0324',

          '´': ' \u0317',
          'é': '\u01DD' + '\u0317',
          'á': '\u0250' + '\u0317',
          'ó': 'o' + '\u0317',
          'ú': 'n' + '\u0317',
          'É': '\u018e' + '\u0317',
          'Á': '\u2200' + '\u0317',
          'Ó': 'O' + '\u0317',
          'Ú': '\u2229' + '\u0317',

          '`': ' \u0316',
          'è': '\u01DD' + '\u0316',
          'à': '\u0250' + '\u0316',
          'ò': 'o' + '\u0316',
          'ù': 'n' + '\u0316',
          'È': '\u018e' + '\u0316',
          'À': '\u2200' + '\u0316',
          'Ò': 'O' + '\u0316',
          'Ù': '\u2229' + '\u0316',

          '^': ' \u032E',
          'ê': '\u01DD' + '\u032e',
          'â': '\u0250' + '\u032e',
          'ô': 'o' + '\u032e',
          'û': 'n' + '\u032e',
          'Ê': '\u018e' + '\u032e',
          'Â': '\u2200' + '\u032e',
          'Ô': 'O' + '\u032e',
          'Û': '\u2229' + '\u032e'
          // TODO: flip more letters with stuff around them. See http://en.wikipedia.org/wiki/Combining_character

        }
      },

      // Mirror text (flip horizontally)
      mirror: {
        init: function () {

          // invert the map
          for (i in this.map) {
            this.map[this.map[i]] = i;
          }

        },

        encode: function (text) {
          var ret = [],
            ch,
            newLines = [];

          for (var i = 0, len = text.length; i < len; i++) {
            ch = text.charAt(i);

            // combining diacritical marks: combine with previous character for ä,ö,ü,...
            if (i > 0 && (ch == '\u0308' ||
              ch == '\u0300' ||
              ch == '\u0301' ||
              ch == '\u0302')) {
              ch = this.map[text.charAt(i - 1) + ch];
              ret.pop();
            } else {
              ch = this.map[ch];
              if (typeof (ch) == "undefined") {
                ch = text.charAt(i);
              }
            }


            if (ch == '\n') {
              newLines.push(ret.reverse().join(""));
              ret = [];
            } else {
              ret.push(ch);
            }
          }
          newLines.push(ret.reverse().join(""));
          return newLines.join("\n");
        },

        // Thanks to http://www.macchiato.com/unicode/mirrored-ascii
        map: {
          'a': 'ɒ',
          'b': 'd',
          'c': 'ɔ',
          'e': 'ɘ',
          'f': 'Ꮈ',
          'g': 'ǫ',
          'h': 'ʜ',
          'j': 'ꞁ',
          'k': 'ʞ',
          'l': '|',
          'n': 'ᴎ',
          'p': 'q',
          'r': 'ɿ',
          's': 'ꙅ',
          't': 'ƚ',
          'y': 'ʏ',
          'z': 'ƹ',
          'B': 'ᙠ',
          'C': 'Ɔ',
          'D': 'ᗡ',
          'E': 'Ǝ',
          'F': 'ꟻ',
          'G': 'Ꭾ',
          'J': 'Ⴑ',
          'K': '⋊',
          'L': '⅃',
          'N': 'Ͷ',
          'P': 'ꟼ',
          'Q': 'Ọ',
          'R': 'Я',
          'S': 'Ꙅ',
          'Z': 'Ƹ',
          '1': '',
          '2': '',
          '3': '',
          '4': '',
          '5': '',
          '6': '',
          '7': '',
          '&': '',
          ';': '',
          '[': ']',
          '(': ')',
          '{': '}',
          '?': '⸮',
          '<': '>',

          'ä': 'ɒ' + '\u0308',
          'ß': 'ᙠ',

          '´': '`',
          'é': 'ɘ' + '\u0300',
          'á': 'ɒ' + '\u0300',
          'ó': 'ò',
          'ú': 'ù',
          'É': 'Ǝ' + '\u0300',
          'Á': 'À',
          'Ó': 'Ò',
          'Ú': 'Ù',

          '`': '´',
          'è': 'ɘ' + '\u0301',
          'à': 'ɒ' + '\u0301',
          'È': 'Ǝ' + '\u0301',

          'ê': 'ɘ' + '\u0302',
          'â': 'ɒ' + '\u0302',
          'Ê': 'Ǝ' + '\u0302',

          'Ø': 'ᴓ',
          'ø': 'ᴓ'

        }
      },

      creepify: {
        init: function () {

          // Sort diacritics in top, bottom or middle

          for (var i = 768; i <= 789; i++) {
            this.diacriticsTop.push(String.fromCharCode(i));
          }

          for (var i = 790; i <= 819; i++) {
            if (i != 794 && i != 795) {
              this.diacriticsBottom.push(String.fromCharCode(i));
            }
          }
          this.diacriticsTop.push(String.fromCharCode(794));
          this.diacriticsTop.push(String.fromCharCode(795));

          for (var i = 820; i <= 824; i++) {
            this.diacriticsMiddle.push(String.fromCharCode(i));
          }

          for (var i = 825; i <= 828; i++) {
            this.diacriticsBottom.push(String.fromCharCode(i));
          }

          for (var i = 829; i <= 836; i++) {
            this.diacriticsTop.push(String.fromCharCode(i));
          }
          this.diacriticsTop.push(String.fromCharCode(836));
          this.diacriticsBottom.push(String.fromCharCode(837));
          this.diacriticsTop.push(String.fromCharCode(838));
          this.diacriticsBottom.push(String.fromCharCode(839));
          this.diacriticsBottom.push(String.fromCharCode(840));
          this.diacriticsBottom.push(String.fromCharCode(841));
          this.diacriticsTop.push(String.fromCharCode(842));
          this.diacriticsTop.push(String.fromCharCode(843));
          this.diacriticsTop.push(String.fromCharCode(844));
          this.diacriticsBottom.push(String.fromCharCode(845));
          this.diacriticsBottom.push(String.fromCharCode(846));
          // 847 (U+034F) is invisible http://en.wikipedia.org/wiki/Combining_grapheme_joiner
          this.diacriticsTop.push(String.fromCharCode(848));
          this.diacriticsTop.push(String.fromCharCode(849));
          this.diacriticsTop.push(String.fromCharCode(850));
          this.diacriticsBottom.push(String.fromCharCode(851));
          this.diacriticsBottom.push(String.fromCharCode(852));
          this.diacriticsBottom.push(String.fromCharCode(853));
          this.diacriticsBottom.push(String.fromCharCode(854));
          this.diacriticsTop.push(String.fromCharCode(855));
          this.diacriticsTop.push(String.fromCharCode(856));
          this.diacriticsBottom.push(String.fromCharCode(857));
          this.diacriticsBottom.push(String.fromCharCode(858));
          this.diacriticsTop.push(String.fromCharCode(859));
          this.diacriticsBottom.push(String.fromCharCode(860));
          this.diacriticsTop.push(String.fromCharCode(861));
          this.diacriticsTop.push(String.fromCharCode(861));
          this.diacriticsBottom.push(String.fromCharCode(863));
          this.diacriticsTop.push(String.fromCharCode(864));
          this.diacriticsTop.push(String.fromCharCode(865));
        },

        encode: function (text) {
          var newText = '',
            newChar;
          for (i in text) {
            newChar = text[i];

            if (this.options.middle) {
              newChar += this.diacriticsMiddle[Math.floor(Math.random() * this.diacriticsMiddle.length)]
            }

            // Top    
            if (this.options.top) {
              var diacriticsTopLength = this.diacriticsTop.length - 1;
              for (var count = 0,
                len = this.options.maxHeight - Math.random() * ((this.options.randomization / 100) * this.options.maxHeight); count < len; count++) {

                newChar += this.diacriticsTop[Math.floor(Math.random() * diacriticsTopLength)]

              }

            }

            // Bottom    
            if (this.options.bottom) {

              var diacriticsBottomLength = this.diacriticsBottom.length - 1;
              for (var count = 0,
                len = this.options.maxHeight - Math.random() * ((this.options.randomization / 100) * this.options.maxHeight); count < len; count++) {

                newChar += this.diacriticsBottom[Math.floor(Math.random() * diacriticsBottomLength)]

              }

            }


            newText += newChar;
          }
          return newText;
        },

        diacriticsTop: [],
        diacriticsMiddle: [],
        diacriticsBottom: [],

        options: {
          top: true,
          middle: true,
          bottom: true,
          maxHeight: 15,   // How many diacritic marks shall we put on top/bottom?
          randomization: 100 // 0-100%. maxHeight 100 and randomization 20%: the height goes from 80 to 100. randomization 70%, height goes from 30 to 100.
        }
      },
      // Circles around Letters. Uses special circle characters for some letters and combining characters for the rest
      // Thanks to
      // - Alan Wood: http://www.alanwood.net/unicode/enclosed_alphanumerics.html
      bubbles: {
        init: function () {

          // Numbers
          for (var i = 49; i <= 57; i++) {
            this.map[String.fromCharCode(i)] = String.fromCharCode(i + 9263);
          }
          this.map['0'] = '\u24ea';

          // Capital letters
          for (var i = 65; i <= 90; i++) {
            this.map[String.fromCharCode(i)] = String.fromCharCode(i + 9333);
          }

          // Lower letters
          for (var i = 97; i <= 122; i++) {
            this.map[String.fromCharCode(i)] = String.fromCharCode(i + 9327);
          }

          // invert the map
          for (i in this.map) {
            this.mapInverse[this.map[i]] = i;
          }

        },

        encode: function (text) {
          var ret = "",
            ch,
            first = true;

          for (i in text) {
            ch = this.map[text[i]];

            // No dedicated circled character available? Use a Combining Diacritical Mark surrounded
            // with non-breaking spaces, so it doesn't overlap
            if ((typeof (ch) == "undefined")) {
              if (text[i].charCodeAt(0) >= 33) {
                ch = text[i] + String.fromCharCode(8413);
                if (!first) {
                  ch = String.fromCharCode(8239) + String.fromCharCode(160) + String.fromCharCode(160) + String.fromCharCode(8239) + ch;
                }
              } else {
                ch = text[i];
              }
            }
            ret += ch;
            first = (ch == '\n');
          }
          return ret;
        },

        map: {},
        mapInverse: {}
      },

      // Puts a Square Combining Character after a letter, thus ensquaring it, squarily.
      squares: {
        init: function () { },

        encode: function (text) {
          var ret = "",
            ch,
            first = true;

          for (i in text) {
            if (text[i].charCodeAt(0) >= 33) {
              ch = text[i] + String.fromCharCode(8414);
              if (!first) {
                ch = String.fromCharCode(8239) + String.fromCharCode(160) + String.fromCharCode(160) + String.fromCharCode(8239) + ch;
              }
            } else {
              ch = text[i];
            }

            ret += ch;
            first = (ch == '\n');
          }
          return ret;
        }
      },


      // Same as squares, just round.
      roundsquares: {
        init: function () { },

        encode: function (text) {
          var ret = "",
            ch,
            first = true;

          for (i in text) {
            if (text[i].charCodeAt(0) >= 33) {
              ch = text[i] + String.fromCharCode(8419);
              if (!first) {
                ch = String.fromCharCode(160) + String.fromCharCode(160) + String.fromCharCode(160) + ch;
              }
            } else {
              ch = text[i];
            }

            ret += ch;
            first = (ch == '\n');
          }
          return ret;
        }
      },

      // Weird looking alternatives to most characters
      bent: {
        init: function () {

          // invert the map
          for (i in this.map) {
            this.map[this.map[i]] = i;
          }

        },

        encode: function (text) {
          var ret = '',
            ch;

          for (var i = 0, len = text.length; i < len; i++) {
            ch = this.map[text.charAt(i)];
            if (typeof (ch) == "undefined") {
              ch = text.charAt(i);
            }
            ret += ch;

          }

          return ret;
        },

        // Thanks to Eddie Ringle for most lowercase letters: http://funicode.com
        map: {
          'a': 'ą',
          'b': 'ҍ',
          'c': 'ç',
          'd': 'ժ',
          'e': 'ҽ',
          'f': 'ƒ',
          'g': 'ց',
          'h': 'հ',
          'i': 'ì',
          'j': 'ʝ',
          'k': 'ҟ',
          'l': 'Ӏ',
          'm': 'ʍ',
          'n': 'ղ',
          'o': 'օ',
          'p': 'ք',
          'q': 'զ',
          'r': 'ɾ',
          's': 'ʂ',
          't': 'է',
          'u': 'մ',
          'v': 'ѵ',
          'w': 'ա',
          'x': '×',
          'y': 'վ',
          'z': 'Հ',
          'A': 'Ⱥ',
          'B': 'β',
          'C': '↻',
          'D': 'Ꭰ',
          'E': 'Ɛ',
          'F': 'Ƒ',
          'G': 'Ɠ',
          'H': 'Ƕ',
          'I': 'į',
          'J': 'ل',
          'K': 'Ҡ',
          'L': 'Ꝉ',
          'M': 'Ɱ',
          'N': 'ហ',
          'O': 'ට',
          'P': 'φ',
          'Q': 'Ҩ',
          'R': 'འ',
          'S': 'Ϛ',
          'T': 'Ͳ',
          'U': 'Ա',
          'V': 'Ỽ',
          'W': 'చ',
          'X': 'ჯ',
          'Y': 'Ӌ',
          'Z': 'ɀ',
          '0': '⊘',
          '1': '������',
          '2': 'ϩ',
          '3': 'Ӡ',
          '4': '५',
          '5': 'Ƽ',
          '6': 'Ϭ',
          '7': '7',
          '8': '������',
          '9': '९',
          '&': '⅋',
          '(': '{',
          ')': '}',
          '{': '(',
          '}': ')',

          'ä': 'ą' + '\u0308',
          'ö': 'օ' + '\u0308',
          'ü': 'մ' + '\u0308',
          'Ä': 'Ⱥ' + '\u0308',
          'Ö': 'ට' + '\u0308',
          'Ü': 'Ա' + '\u0308',

          'é': 'ҽ' + '\u0301',
          'á': 'ą' + '\u0301',
          'ó': 'օ' + '\u0301',
          'ú': 'մ' + '\u0301',
          'É': 'Ɛ' + '\u0301',
          'Á': 'Ⱥ' + '\u0301',
          'Ó': 'ට' + '\u0301',
          'Ú': 'Ա' + '\u0301',

          'è': 'ҽ' + '\u0300',
          'à': 'ą' + '\u0300',
          'ò': 'օ' + '\u0300',
          'ù': 'մ' + '\u0300',
          'È': 'Ɛ' + '\u0300',
          'À': 'Ⱥ' + '\u0300',
          'Ò': 'ට' + '\u0300',
          'Ù': 'Ա' + '\u0300',

          'ê': 'ҽ' + '\u0302',
          'â': 'ą' + '\u0302',
          'ô': 'օ' + '\u0302',
          'û': 'մ' + '\u0302',
          'Ê': 'Ɛ' + '\u0302',
          'Â': 'Ⱥ' + '\u0302',
          'Ô': 'ට' + '\u0302',
          'Û': 'Ա' + '\u0302'
        }
      },


      // Tiny Capitals
      tiny: {
        init: function () {

          // invert the map
          for (i in this.map) {
            this.map[this.map[i]] = i;
          }

        },

        encode: function (text) {
          var ret = '',
            ch;
          text = text.toUpperCase();
          for (var i = 0, len = text.length; i < len; i++) {
            ch = this.map[text.charAt(i)];
            if (typeof (ch) == "undefined") {
              ch = text.charAt(i);
            }
            ret += ch;

          }

          return ret;
        },

        decode: function (text) {
          var ret = '',
            ch;

          for (var i = 0, len = text.length; i < len; i++) {
            ch = this.map[text.charAt(i)];
            if (typeof (ch) == "undefined") {
              ch = text.charAt(i);
            }
            ret += ch;
          }
          return ret;
        },

        // TODO: Find small lower case letters
        map: {
          'A': 'ᴀ',
          'B': 'ʙ',
          'C': 'ᴄ',
          'D': 'ᴅ',
          'E': 'ᴇ',
          'F': 'ꜰ',
          'G': 'ɢ',
          'H': 'ʜ',
          'I': 'ɪ',
          'J': 'ᴊ',
          'K': 'ᴋ',
          'L': 'ʟ',
          'M': 'ᴍ',
          'N': 'ɴ',
          'O': 'ᴏ',
          'P': 'ᴘ',
          'Q': 'Q',
          'R': 'ʀ',
          'S': 'ꜱ',
          'T': 'ᴛ',
          'U': 'ᴜ',
          'V': 'ᴠ',
          'W': 'ᴡ',
          'X': 'x',
          'Y': 'ʏ',
          'Z': 'ᴢ'
        }
      }

    };

    // init
    for (i in this.tools) {
      this.tools[i].init();
    }

    // Encode every character: U+00A0 -> &#x00a0; etc. 
    this.getHTML = function (text) {
      var html = '',
        ch,
        lastSpaceWasNonBreaking = true, // for alternating [non-braking] spaces
        highSurrogate = 0,
        codepoint = 0;

      for (var i = 0, len = text.length; i < len; i++) {
        ch = text.charCodeAt(i);

        // line break: add <br>\n
        if (ch == 10 || ch == 13) {
          html += '<br>\n';
          lastSpaceWasNonBreaking = true;

          // space: add alternating space and non-breaking space (U+00A0). Otherwise
          // a series of normal spaces       would collapse to one in the browser  
        } else if (ch == 32) {
          if (lastSpaceWasNonBreaking) {
            html += ' ';
            lastSpaceWasNonBreaking = false;
          } else {
            html += '&nbsp;';
            lastSpaceWasNonBreaking = true;
          }

          // Normal character: Decode. Special cases for higher numbers:
          // http://en.wikipedia.org/wiki/Mapping_of_Unicode_characters#Surrogates
        } else {


          // Character is high surrogate: Remember and continue
          if (ch >= 0xD800 && ch <= 0xDBFF) {
            highSurrogate = ch;
            codepoint = 0;

            // last character was high surrogate: Combine with low surrogate  
          } else if (highSurrogate > 0) {

            // If char is low surrogate:
            if (ch >= 0xDC00 && ch <= 0xDFFF) {
              codepoint = (highSurrogate - 0xD800) * 1024 + (ch - 0xDC00) + 0x10000;
            }
            highSurrogate = 0;

            // no surrogates: Just take the character  
          } else {
            codepoint = ch;
          }

          if (codepoint != 0) {
            html += '&#x' + codepoint.toString(16) + ';';
            lastSpaceWasNonBreaking = true;
          }

        }
      }

      return html;
    }
  }
})()

function copyRes(id) {
  const el = document.getElementById(id)
  if (el) {

    navigator.permissions.query({ name: "clipboard-write" }).then((result) => {
      if (result.state === "granted" || result.state === "prompt") {
        navigator.clipboard.writeText(el.textContent).then(() => {
          aqyanoosShortAlert("Copied to the Clipboard Successfully!");
        }, () => {
          aqyanoosShortAlert("Copy Failed, Try Again!");
        });
      }
    });
  }
}

function aqyanoosShortAlert(txt) {
  if (document.querySelector('.custom-alert')) {
    document.querySelector('.custom-alert').remove();
  }

  const secEl = document.createElement('section');
  secEl.className = "custom-alert";
  secEl.innerHTML = `<div class="ca-container s"><div class="ca-description">${txt}</div></div>`;

  document.body.appendChild(secEl);
  setTimeout(() => { secEl.remove() }, 2000)
}
